#Область ПрограммныйИнтерфейс

Процедура ЗагрузкаДисконтныхКарт() Экспорт
	Данные = ДанныеДляПодключенияКролика();	
	Данные.Вставить("ИмяОчереди", "discount_cards_from_mobile");
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
	Клиент  = Новый("AddIn.BITERP.PinkRabbitMQ");
	Попытка
		Клиент.Connect(
		Данные.ИмяХоста,
		Данные.Порт,
		Данные.Логин,
		Данные.Пароль,
		Данные.ВиртуальныйХост);
		
		
		ИмяОчереди = Данные.ИмяОчереди;
		
		Попытка
			Потребитель = Клиент.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			ОтветноеСообщение = "";
			Если Клиент.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				Клиент.BasicAck(); 
				ОбработкаДанныхДисконтныхКарт(ОтветноеСообщение);
			Иначе
			КонецЕсли;
			Клиент.BasicCancel("");
		Исключение
			ВызватьИсключение Клиент.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузкаЗаявокНаВывод() Экспорт
	Данные = ДанныеДляПодключенияКролика();	
	Данные.Вставить("ИмяОчереди", "withdrawal_request");
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
	Клиент  = Новый("AddIn.BITERP.PinkRabbitMQ");
	Попытка
		Клиент.Connect(
		Данные.ИмяХоста,
		Данные.Порт,
		Данные.Логин,
		Данные.Пароль,
		Данные.ВиртуальныйХост);
		
		
		ИмяОчереди = Данные.ИмяОчереди;
		
		Попытка
			Потребитель = Клиент.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			ОтветноеСообщение = "";
			Если Клиент.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				Клиент.BasicAck(); 
				ОбработкаЗаявокНаВывод(ОтветноеСообщение);
			Иначе
			КонецЕсли;
			Клиент.BasicCancel("");
		Исключение
			ВызватьИсключение Клиент.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыгрузкаОстатковБонусов() Экспорт
	Данные = ДанныеДляПодключенияКролика();	
	Данные.Вставить("ИмяОчереди", "balances");
	Данные.Вставить("Ключ", "bl");
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
	Клиент  = Новый("AddIn.BITERP.PinkRabbitMQ");
	
	Клиент.Connect(
	Данные.ИмяХоста,
	Данные.Порт,
	Данные.Логин,
	Данные.Пароль,
	Данные.ВиртуальныйХост);
	
	ИмяОчереди = Данные.ИмяОчереди;
	ТочкаОбмена = Данные.ИмяТочкиОбмена;
	
	ДанныеJSON = Новый Структура;
	ДанныеJSON.Вставить("cardNumber", "000000004");
	ДанныеJSON.Вставить("amount", "5");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	ТекстСообщения = ЗаписьJSON.Закрыть();	
	
	Попытка	
	
		Клиент.BasicPublish(
			ТочкаОбмена,     // exchange
			Данные.Ключ,     // routingKey - тот ключ, по которому настроена привязка
			ТекстСообщения,  // message
			0,               // livingTime
			Ложь             // persist
		);
		
		ЗаписьЖурналаРегистрации("Выгрузка остатков бонусов", , , , 
			"Сообщение успешно отправлено в exchange: " + ТочкаОбмена + " с ключом: bl");
		
	Исключение
		ТекстОшибки = "Выгрузка остатков бонусов завершилась с ошибкой: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Выгрузка остатков бонусов", , , , ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПодключенияКролика()
	Данные = Новый Структура;
	Данные.Вставить("ИмяХоста", "localhost");
	Данные.Вставить("Порт", 5672);
	Данные.Вставить("Логин", "guest");
	Данные.Вставить("Пароль", "guest");
	Данные.Вставить("ВиртуальныйХост", "otus");
	Данные.Вставить("ИмяТочкиОбмена", "discount_cards");
	
	Возврат Данные;
КонецФункции             

Процедура ОбработкаДанныхДисконтныхКарт(ОтветноеСообщение)
	РеквизитыКонтрагента = СтрокуJSONВСтруктуру(ОтветноеСообщение);      
	Контрагент = КонтрагентПоРеквизитам(РеквизитыКонтрагента);
	СоздатьДисконтнуюКарту(Контрагент);
КонецПроцедуры  

Процедура ОбработкаЗаявокНаВывод(ОтветноеСообщение)
	РеквизитыЗаявки = СтрокуJSONВСтруктуру(ОтветноеСообщение);  
	СоздатьЗаявкуНаВывод(РеквизитыЗаявки);
КонецПроцедуры                                                  


Функция СтрокуJSONВСтруктуру(Значение)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
КонецФункции  

Функция КонтрагентПоРеквизитам(Реквизиты)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Телефон КАК Телефон,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Телефон = &Телефон
	|	И Контрагенты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Телефон", Реквизиты.phoneNumber);
	Запрос.УстановитьПараметр("Наименование", СтрШаблон("%1 %2 %3", Реквизиты.surname, Реквизиты.name, Реквизиты.middleName));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		
		Возврат НовыйКонтрагент(Реквизиты);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция НовыйКонтрагент(Реквизиты)
	НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовКонтрагент.Наименование = СтрШаблон("%1 %2 %3", Реквизиты.surname, Реквизиты.name, Реквизиты.middleName);
	НовКонтрагент.Телефон = Реквизиты.phoneNumber;
	НовКонтрагент.ОбменДанными.Загрузка = Истина;
	НовКонтрагент.Записать();
	
	Возврат НовКонтрагент.Ссылка;
КонецФункции    

Процедура СоздатьДисконтнуюКарту(Контрагент)  
	ДК = Справочники.ДисконтныеКарты.СоздатьЭлемент(); 
	ДК.УстановитьНовыйКод();
	ДК.ОбменДанными.Загрузка = Истина;
	ДК.Владелец = Контрагент;
	ДК.Записать();
КонецПроцедуры    

Процедура СоздатьЗаявкуНаВывод(РеквизитыЗаявки)
	ДискотнаяКарта = Справочники.ДисконтныеКарты.НайтиПоКоду(РеквизитыЗаявки.cardNumber);
	Если ДискотнаяКарта.Пустая() Тогда 
		ТекстСообщения = СтрШаблон( "Не найдена карта с номером %1", РеквизитыЗаявки.cardNumber);
		ЗаписьЖурналаРегистрации("Загрузка заявок",, ,,ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ДокСписание = Документы.СписаниеБонусов.СоздатьДокумент();     
	ДокСписание.Дата = ТекущаяДатаСеанса();
	//	ДокСписание.Номер = ДокСписание.УстановитьНовыйНомер();
	ДокСписание.ДисконтнаяКарта = ДискотнаяКарта;
	ДокСписание.Бонусов = РеквизитыЗаявки.amount;
	//	ДокСписание.ОбменДанными.Загрузка = Истина; 
	ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры


#КонецОбласти