
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Бонусы.Записывать = Истина;     
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БонусыОстатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ВЫБОР
	|		КОГДА СписаниеБонусов.Бонусов <= ЕСТЬNULL(БонусыОстатки.СуммаОстаток, 0)
	|			ТОГДА СписаниеБонусов.Бонусов
	|		ИНАЧЕ ЕСТЬNULL(БонусыОстатки.СуммаОстаток, 0)
	|	КОНЕЦ КАК БонусовСписать
	|ИЗ
	|	Документ.СписаниеБонусов КАК СписаниеБонусов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Бонусы.Остатки(, ДисконтнаяКарта = &ДисконтнаяКарта) КАК БонусыОстатки
	|		ПО СписаниеБонусов.ДисконтнаяКарта = БонусыОстатки.ДисконтнаяКарта
	|ГДЕ
	|	СписаниеБонусов.Ссылка = &Ссылка"; 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
	//ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	//Запрос.УстановитьПараметр("ТочкаИтогов", ГраницаКонтроля);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда    
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Движение = Движения.Бонусы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ДисконтнаяКарта = ДисконтнаяКарта;
		Движение.Сумма = Выборка.БонусовСписать; 
	КонецЕсли;
	
КонецПроцедуры
